import React from 'react'
import styles from "../../styles/About.module.css"
import { NavLink } from 'react-router-dom'
export const AboutSets = () => {
    return (
        <div className={styles.aboutContainer}>
            <h1 className={styles.aboutH1}>Доставка суші-сетів для великої компанії</h1>
            <span className={styles.aboutText}>Сет-суші — це найкращий вибір, якщо ви плануєте вечірку вдома. Або романтичний вечір. Або просто хочете багато-багато смачних ролів. Ми подбали про те, щоб кожен набір був особливим. Та головне — дуже смачним. Замовити суші-сети додому від <NavLink to="/">Monosushi</NavLink> можна щодня й без вихідних. Просто оберіть варіант, який вам найбільше сподобався!</span>
            <h3 className={styles.aboutH3}>Суші-сети від Monosushi — яскравий смак та гігантські порції</h3>
            <span className={styles.aboutText}>
                Ми готуємо суші-сети на будь-який смак. Кожна порція — справді велика, тож вистачить на компанію друзів. Свіжість, пікантність, гострика — в сетах гармонійно поєднуються різні смаки, які дарують справжню насолоду.
                Чому варто замовити суші сет від Monosushi:
                <ol>
                    <li>  Можливість спробувати різні смаки. Сет суші з доставкою — це зажди різноманіття ролів і чудова нагода спробувати варіанти, які ви ще ніколи не куштували.</li>
                    <li>Вдалий вибір на компанію. Коли вдома збираються родичі та друзі, домовитися про доставку їжі буває складно. Але сет суші — це завжди компроміс. Ви можете обрати набір, в якому будуть різні роли — такі ж різні, як і смаки ваших гостей.</li>
                    <li>Економія коштів для вас. У сеті — дешевше, ніж окремо. Ви можете не переплачувати за кілька маленьких позицій.</li>
                    <li>Швидка доставка суші сетів у будь-який куточок міста.</li>
                    <li>Ми знаємося на секретах приготування суші. Тож впевнені: наші роли вам точно сподобаються, а доставка суші-сетів у Львові здивує швидкістю та пунктуальністю.</li>
                </ol>
            </span>

        </div>
    )
}
