import React from 'react'
import styles from "../../styles/About.module.css"
import { useState } from 'react';

export default function About() {


    const [showFootBloks, setShowFootBloks] = useState(false);
    const [btnFoot, setBtnFoot] = useState(false)
    function showInfoFoot() {
        setShowFootBloks(!showFootBloks)
        setBtnFoot(!btnFoot)
    }


    return (
        <div className={styles.about}>
            <span className={styles.footerMainText}>Суші у Львові – швидка доставка від Monosushi</span>
            <p className={styles.footparagraf}>
                Зголодніли? Доставка суші у Львові від Monosushi — це чудовий вибір! Філадельфія, Каліфорнія, Зелений Дракон, авторські запечені роли — різноманітне та смачне меню чекає саме на вас. Ми знаємо, як задовільнити примхи навіть найвибагливіших гурманів. Готуємо смачно, доставляємо швидко (від 29 хвилин), пропонуємо акції та знижки! Настав час замовити суші у Львові: запрошуємо переглянути наше меню.
            </p>
            <div>
                <span className={styles.footerMainText}>Безкоштовна доставка суші у Львові: готуємо смачно, привозимо вчасно</span>
                <p className={styles.footparagraf}>
                    Львів — місто зі швидким темпом. В шаленому ритмі  життя тут не завжди хочеться витрачати час на приготування їжі. Саме тому, доставка суші — це чудова ідея! Незалежно від нагоди та погоди за вікном, смачні суші піднімуть настрій. На обід, вечерю, романтичне побачення чи домашню вечірку — замовити суші можна з будь-якої нагоди.

                    Просто оберіть рол з меню, а про майстерне приготування та швидку доставку в будь-який куточок міста подбаємо ми! Використовуємо лише добірні інгредієнти: крем сир, водорості норі, ікра масаго, креветка, зелена цибуля, огірок, сніжний краб. Кожна страва — справді дуже смачна!
                </p>

                {showFootBloks ? <div>
                    <span className={styles.footerMainText}>Чому варто замовити суші з доставкою в Monosushi?</span>
                    <p className={styles.footparagraf}>
                        Ми любимо суші та справді добре їх готуємо! Замовляти найкращі суші у Львові від Monosushi додому або в офіс — це чудова ідея! Адже наша швидка доставка суші гарантує для всіх клієнтів:
                    </p>

                    <ul>
                        <br />
                        <li className={styles.footparagraf}>Високу якість. Тільки найкращі суші за рецептами від шефа та добірні інгредієнти — наше правило. Водорості норі, креветки, авокадо, лосось, вугор, ікра, кунжут соєвий соус, крем-сир, соус Унагі — все це та багато іншого ми купуємо лише в перевірених постачальників.</li>
                        <li className={styles.footparagraf}>      Асортимент на різний смак — їжа, яка вам точно сподобається. Ми пропонуємо страви на різні смаки: класичні, авторські суші на компанії. Все це в наявності завжди. Неперевершений смак гарантовано.</li>
                        <li className={styles.footparagraf}>Швидкість доставки у Львові та за межами міста. Забудьте про тривале очікування: улюблені суші або цілий сет будуть на вашому столі вже за 60 хвилин. Доставимо безкоштовно роли у Львові при замовленні японської кухні на мінімальну суму. Також забрати суші можна самостійно з наших точок самовивозу.</li>
                        <br />
                    </ul>
                    <p className={styles.footparagraf}>
                        Для наших гостей ми смачно готуємо, швидко доставляємо по Львову та пропонуємо найвигідніші ціни. Робимо процес замовлення суші легким та приємним. У нас завжди діють знижки, тож замовити суші можна недорого.  Доставка їжі від Monosushi  — це поєднання найкращих інгредієнтів, майстерності шеф-кухарів та швидкої доставки в будь-який куточок міста!
                    </p>
                </div>
                    : null}

                <button onClick={showInfoFoot} className={styles.knowMoreBtn}>{btnFoot ? 'Згорнути' : 'Дізнатись більше...'}</button>

            </div>
        </div>
    )
}
