import React from 'react'
import styles from "../../styles/About.module.css"



export const AboutSushi = () => {
    return (
        <div className={styles.aboutContainer}>
            <h1 className={styles.aboutH1}>Суші роли: по-справжньому великі порції від Monosushi</h1>
            <span className={styles.aboutText}>У світі японської кухні є страва, яка закохує з першого шматочка. Це — роли. Якщо ви любите їх так само як і ми, запрошуємо поринути у гастрономічну подорож з Monosushi. Готуємо та доставляємо роли у Львові, які вам сподобаються. Використовуємо добірні складники, дбаємо про дотримання секретних технологій приготування, дбаємо про швидку доставку ролів додому та в офіс. Щодня, з <b>11:00</b> до <b>23:00</b> ви можете замовити суші з доставкою!</span>
            <h3 className={styles.aboutH3}>Бажаєте замовити cуші-роли у Львові? Monosushi вже тут</h3>
            <span className={styles.aboutText}>Ми перфекціоністи. І справді любимо азійську кухню. Саме тому, готуємо роли, якими не хочеться ділитися: кожен шматочок тішить неймовірним смаком. Головний секрет Monosushi — це якісні продукти. Для приготування використовуємо добірні морепродукти, сир, авокадо, соус унагі та спайсі, водорості норі. Не економимо, обираючи інгредієнти для суші. Це — важливе правило.
                На нашій кухні — ідеальна чистота. Дотримуємося санітарних норм, щоб ви були на 100% впевнені в безпеці страв, які замовляєте з доставкою. Шеф-кухарі слідкують за дотриманням усіх правил приготування ролів, ретельно перевіряють якість кожної порції.
                А ще, команда Monosushi:

                Уважна до деталей. Ми — перфекціоністи. Тож ідеальним буде все: від смаку ролів до впакування та подачі. Подбаємо про те, щоб ви отримали суші смачними, свіжими й естетичними.
                Дуже пунктуальна. Якщо ви голодні, суші хочеться вже і зараз. Не змусимо чекати: роли з доставкою у Львові привеземо за 43 хвилини. Це – наш середній час доставки містом.
                Має вигідні акції для вас. Тішимо вас знижками та даруємо роли на день народження. Ознайомитися з акціями можна у відповідному розділі на нашому сайті.
                Ми любимо смачні роли, готуємо їх з турботою та можемо доставити за будь-якою адресою в місті та за його межами!</span>
        </div>
    )
}
