import React from 'react'
import { NavLink } from 'react-router-dom'
import styles from "../../styles/About.module.css"



export default function AboutMoti() {
    return (
        <div className={styles.aboutContainer}>
            <h1 className={styles.aboutH1}>   Японський десерт моті у Львові — новинка в асортименті Monosushi</h1>
            <span className={styles.aboutText}> Хто сказав, що японська кухня — це лише суші? Якщо ви ніколи не куштували моті — улюблений десерт, родом з Японії — настав саме час! Кур’єри <NavLink to="/">Monosushi</NavLink> вже поспішають привезти тістечко з рисового борошна саме для вас. Швидко та вчасно доставимо замовлення у будь-який куточок Львова!</span>
            <h3 className={styles.aboutH3}>Що таке моті?</h3>
            <span className={styles.aboutText}>Моті — це японський десерт з рисового борошна, без якого не обходиться чайна церемонія. Він нагадує щось середнє між тістечком та морозивом. Щільне, в’язке тісто в моті поєднане з ніжною, збитою начинкою. Яскравий колір десерт моті отримує завдяки натуральним барвникам — ягідним та фруктовим сокам, зеленому чаю.

                Готують моті з різними наповнювачами. Для начинки можуть використовуватися:
                <ol>
                    <li> манго;</li>
                    <li>  кокос;</li>
                    <li>  вершковий крем;</li>
                    <li>різноманітні ягоди та фрукти;</li>
                    <li>морозиво.</li>
                    <li>Проте традиційна начинка, з якою готували японський десерт моті на батьківщині, це варені боби адзукі. В Японії досі можна замовити моті з такою начинкою.</li>
                </ol>

                За класичним рецептом приготування, для моті використовують рис мотігоме. Це — особливий сорт рису, який має високий вміст крохмалю та солодкий смак. Саме завдяки використанню рисового борошна з мотігоме, тістечка моті отримують неповторну текстуру.

                Це цікаво: в стародавні часи, японський десерт моті вважався їжею аристократів. Його споживати могли лише наближені до імператора особи. Це було пов’язано з рідкісністю рису мотігоме, а також складністю приготування десерту. Тож чудово, що ми живемо у 21 столітті, й доставка моті у Львові доступна кожному! Якщо ви бажаєте скуштувати японський десерт, тепер достатньо оформити замовлення онлайн. Зручно, швидко та просто. Й доступно за вартістю.</span>

            <h3 className={styles.aboutH3}>Бажаєте скуштувати моті? Львів, зустрічай доставку з Monosushi</h3>
            <span className={styles.aboutText}>
                Якщо дуже хочеться солодкого, а всі звичайні десерти набридли, моті Львів — найкращий вибір! Багато різновидів начинок, приготування за традиційними японськими рецептами та з добірних продуктів — переваги моті, які ми продаємо. Тож не зволікайте: замовляйте десерти, щоб скуштувати справжні моті, родом з Японії!

                З нами ви можете бути впевненими в тому, що доставка буде вчасною, японський десерт — смачним, а ціни на страви — вигідними! Щоб оформити замовлення:

                Оберіть моті та додайте його у кошик. Ми подбали про ретельний опис кожної позиції, щоб ви могли знайти десерт до душі.
                Залишити свої контакти. Ми зателефонуємо вам за 2-3 хвилини, зорієнтуємо за часом доставки.
                Отримати замовлення біля дверей. Наш кур’єр може привезти замовлення у будь-який куточок Львова. Для того, щоб ви могли смакувати улюблений японський десерт вдома або в офісі.
                Замовляйте та насолоджуйтеся!
            </span>
        </div>
    )
}
