import React from 'react'
import styles from "../../styles/Oferta.module.css"
import { NavLink } from 'react-router-dom'

export const OfertaPage = () => {


    return (

        <div className={styles.mainConatiner}>
            <h1 className={styles.nameOfPage}>Оферта</h1>
            <h3>Договір публічної оферти</h3>
            <span className={styles.textDescribe}>
                За цим Договором одна сторона “ФОП Мурайко Вікторія Володимирівна”, “ФОП Цекот Ірина Анатоліївна” та “ФОП Сулима Вероніка Ігорівна” – Продавець, з одного боку,
                і будь-яка особа, яка прийняла умови даного Договору публічної оферти – Покупець, з іншого боку, далі разом – Сторони, уклали даний Договір, адресований необмеженому колу осіб, який є офіційною публічною пропозицією Продавця укласти з Покупцями договір купівлі-продажу Товарів, асортимент та детальна інформація про які міститься на сайті https://monosushi.com.ua.
                Покупці при придбанні Товарів, асортимент та детальна інформація про які міститься на сайті <NavLink to='/'>https://monosushi.com.ua</NavLink>, приймають умови цього Договору про нижченаведене.
            </span>
            <h5 className={styles.headerText}>1. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h5>
            <span className={styles.textDescribe}>
                1.1. Договірні відносини між Продавцем і Покупцем оформляються у вигляді Договору публічної оферти.<br></br>
                1.2. Договір публічної оферти є публічним, тобто відповідно до статей 633, 641 Цивільного кодексу України його умови однакові для всіх Покупців незалежно від статусу (фізична особа, юридична особа, фізична особа — підприємець). При повній згоді з даним Договором Покупець приймає умови та порядок оформлення замовлення, оплати та доставки товару Продавцем, відповідальності за невиконання умов цього Договору.
            </span>
            <h5 className={styles.headerText}>2. ТЕРМІНИ І ВИЗНАЧЕННЯ</h5>
            <span className={styles.textDescribe}>
                «Договір публічної оферти» – публічний договір, зразок якого розміщений на сайті https://monosushi.com.ua, що містить пропозицію Продавця щодо придбання Товару, асортимент та детальна інформація про який міститься на сайті https://monosushi.com.ua, спрямовану невизначеному колу осіб.
                «Акцепт» – прийняття Покупцем пропозиції Продавця щодо придбання Товару, асортимент та детальна інформація про який міститься на сайті https://monosushi.com.ua, шляхом додавання його у віртуальний кошик та відправлення Замовлення.
                «Сайт» – сайт https://monosushi.com.ua.
                «Товар» – страви та напої, які пропонуються до продажу, відповідно до асортименту та цін, зазначених на сайті https://monosushi.com.ua.
                «Продавець» – Сервіс доставки суші Моносуші.
                «Покупець» – будь-яка дієздатна фізична, юридична особа, фізична особа-підприємець, що відвідали сайт https://monosushi.com.ua та мають намір придбати той чи інший Товар.
                «Замовлення» – належно оформлена заявка Покупця на купівлю Товарів, що адресується Продавцю.
            </span>
            <h5 className={styles.headerText}> 3. ПРЕДМЕТ ДОГОВОРУ</h5>
            <span className={styles.textDescribe}>
                3.1. Продавець зобов’язується на умовах та в порядку, визначених цим Договором, продати Товар на основі Замовлення, оформленого Покупцем, а Покупець зобов’язується на умовах та в порядку, визначених цим Договором, придбати Товар і сплатити за нього кошти.
            </span>
            <h5 className={styles.headerText}> 4. ПОРЯДОК ОФОРМЛЕННЯ ЗАМОВЛЕННЯ</h5>
            <span className={styles.textDescribe}>
                4.1. Покупець може оформити замовлення самостійно на Сайті або по телефону з допомогою оператора.<br></br>
                4.2. Замовлення Продавцем приймаються щодня без перерви і вихідних з 11:00 до 22:45.<br></br>
                4.3. Щоб оформити Замовлення через Сайт Покупцю необхідно:<br></br>
                – обрати Товари, представлені на Сайті, їх кількість, та натиснути «Замовити», Товар буде автоматично додано до розділу «Кошик»;<br></br>
                – заповнити дані у відповідній електронній формі замовлення, обрати спосіб оплати Товару;<br></br>
                – після закінчення замовлення вибрати функцію «Оформити замовлення».<br></br>
                4.4. Замовлення вважається оформленим та прийнятим до виконання Продавцем у випадку, коли:<br></br>
                4.4.1. після завершення Покупцем дій по оформленню замовлення на Сайті, оператор кол-центру Продавця у телефонному режимі зв’яжеться із Покупцем, за необхідності уточнить деталі замовлення, та підтвердить Покупцю про прийняття відповідного замовлення в роботу;<br></br>
                4.4.2. після здійснення Покупцем замовлення у телефонному режимі, оператор кол-центру Продавця усно підтвердить Покупцю про прийняття відповідного замовлення в роботу.<br></br>
                4.5. У випадку, якщо оператор кол-центру Продавця не підтвердить Покупцю про прийняття відповідного замовлення в роботу, таке замовлення вважається неоформленим та не підлягає виконанню Продавцем.<br></br>
                4.6. Покупець несе повну відповідальність за правильність та достовірність даних, вказаних ним при оформленні замовлення.<br></br>
                4.7. Продавець зобов’язується надати Покупцю усю інформацію, що пов’язана з товарами, оформленням та виконанням замовлення, та є необхідною для здійснення вибору та оформлення замовлення.<br></br>
            </span>
            <h5 className={styles.headerText}> 5. ДОСТАВКА ЗАМОВЛЕННЯ</h5>
            <span className={styles.textDescribe}>
                5.1. Товар доставляється Продавцем або залученими ним третіми особами, або шляхом самостійного вивозу (самовивіз) із місця видачі замовлення. При неможливості зв’язатися з Покупцем за вказаним ним при здійсненні замовлення номером телефону, Замовлення вважається анульованим.<br></br>
                5.2. Самовивіз здійснюється Покупцем із місця видачі замовлення, зазначеного Покупцем при оформленні замовлення з можливих варіантів, що вказані оператором кол-центру Продавця під час підтвердження замовлення.<br></br>
                5.3. Територія доставки товарів, запропонованих на Сайті, обмежена, детальну інформацію щодо території доставки та суми мінімального замовлення розміщено на Сайті за посиланням: http://monosushi.com.ua/dostavka-ta-oplata/. В міста та/або райони міст, які не зазначено в даному розділі, доставка не здійснюється. Детальна інформація щодо адрес доставки надається за номерами телефонів, вказаними на Сайті.<br></br>
                5.4. Режим роботи Продавця та час доставки зазначаються на Сайті.<br></br>
                5.5. Затримки у доставці Товарів можливі за умови настання непередбачених обставин, що сталися не з вини Продавця.<br></br>
                5.6. Доставка Замовлення Покупцеві здійснюється Продавцем на адресу, вказану у замовленні.<br></br>
                5.7. Право власності на Товар, а також ризик його випадкового пошкодження чи втрати переходять до Покупця з моменту передачі Товару.<br></br>
                5.8. При прийнятті Замовлення, Покупець зобов’язаний перевірити Товар на відповідність замовленому і цілісність упаковки. У разі відсутності претензій до доставленого Товару, Покупець оплачує Замовлення. Оплата Товару Покупцем свідчить про те, що претензій до Товару не заявлено і Продавець повністю і належним чином виконав свій обов’язок щодо передачі Товару.<br></br>
            </span>
            <h5 className={styles.headerText}>6. ОПЛАТА ТОВАРУ</h5>
            <span className={styles.textDescribe}>
                6.1. Ціна Товару вказується в гривнях.<br></br>
                6.2. Загальна вартість замовлення складається з вартості усіх Товарів, зазначених у підтвердженому оператором кол-центру Продавця замовленні Покупця, з урахуванням актуальної на час оформлення замовлення вартості цих Товарів, вказаної на Сайті, усіх податків та зборів, а також з вартості комплектації замовлення.<br></br>
                6.3. Загальна вартість замовлення повідомляється оператором кол-центру Продавця Покупцеві при оформленні замовлення.<br></br>
                6.4. Оплата Товару здійснюється готівкою кур’єру при отриманні замовлення, або безготівковим розрахунком, шляхом внесення оплати за допомогою банківських карток на сайті або при отриманні замовлення, або онлайн за допомогою електронного платежу.<br></br>
                6.5. Оплата Товарів здійснюється в національній валюті України.<br></br>
                6.6. У випадку, якщо Покупцем було обрано безготівкову форму оплати вартості замовлення Товар передається Покупцю лише за умови оплати повної вартості Товару. У такому випадку оплата вартості Товару вважається здійсненою в момент зарахування відповідних грошових коштів на рахунок Продавця.<br></br>
                6.7. Продавець має право зупинити виконання замовлення та/або скасувати замовлення в односторонньому порядку у випадку невиконання або неналежного виконання Покупцем обов’язку з оплати відповідного замовлення до моменту доставки Товарів кур’єром за адресою доставки, вказаною Покупцем (у випадку вибору кур’єрської доставки як способу доставки) або до моменту пред’явлення Покупцем вимоги про надання Товарів у місці видачі замовлень (у випадку вибору самовивозу з місця видачі замовлення).<br></br>
                6.8. Вартість та асортимент товарів на Сайті може бути змінена Продавцем на власний розсуд в будь-який час без необхідності повідомлення про це Покупця. При цьому, вартість товарів, що вказана на Сайті на час оформлення конкретного замовлення, є актуальною для оформлення цього замовлення.
            </span>
            <h5 className={styles.headerText}> 7. ПОРЯДОК ПОВЕРНЕННЯ ТОВАРУ</h5>
            <span className={styles.textDescribe}>
                7.1. Покупець має право відмовитися від отриманого товару неналежної якості після його огляду в момент прийому товару.<br></br>
                7.2. В разі відмови від товару неналежної якості, вартість якого була сплачена Покупцем шляхом безготівкового розрахунку, Продавець повертає кошти Покупцеві за товар неналежної якості протягом 3-х банківських днів.<br></br>
            </span>
            <h5 className={styles.headerText}> 8. ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН</h5>
            <span className={styles.textDescribe}>
                8.1. За даним Договором Продавець бере на себе зобов’язання продати Товари, запропоновані до продажу на Сайті відповідно до оформленого належним чином Замовлення Покупця та умов даної оферти, а Покупець зобов’язується прийняти та оплатити замовлені ним Товари.<br></br>
                8.2. Даний Договір поширюється на всі Товари, продемонстровані на Сайті на момент здійснення Замовлення Покупцем.<br></br>
                8.3. Продавець зобов’язується:
                – продавати Товари, передбачені умовами даного Договору;<br></br>
                – забезпечити можливість замовлення та оплати Товарів;<br></br>
                – надавати консультації з питань користування Сайтом та оформлення Замовлення;<br></br>
                8.4. Продавець має право:<br></br>
                – відмовити у продажі та/або передачі замовлених Товарів у зв’язку з неналежним виконанням Покупцем своїх зобов’язань відповідно до даного Договору;<br></br>
                – вносити зміни до даного Договору в односторонньому порядку;<br></br>
                – вносити зміни щодо інформації, розміщеної на Сайті в односторонньому порядку та на власний розсуд;<br></br>
                – залучати третіх осіб для виконання своїх зобов’язань перед Покупцем;<br></br>
                – змінювати умови та/або термін доставки Товарів Покупцю за умови повідомлення Покупця про такі зміни за вказаним ним при здійсненні замовлення номером телефону;<br></br>
                8.5. Покупець зобов’язується:
                – дотримуватись умов даного Договору;<br></br>
                – прийняти Товар належної якості, який відповідає замовленню Покупця;<br></br>
                – оплатити Товар до його отримання або в момент його отримання;<br></br>
                – перевірити кількість та найменування замовлених Товарів при їх отриманні.<br></br>
                8.6. Покупець має право: – вимагати від Продавця продажу Товарів у відповідності до умов даного Договору.
            </span>
            <h5 className={styles.headerText}> 9. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h5>
            <span className={styles.textDescribe}>
                9.1. У разі невиконання або неналежного виконання своїх зобов’язань за Договором Сторони несуть відповідальність, передбачену чинним законодавством та цим Договором.<br></br>
                9.2. Продавець не несе відповідальності за шкоду, заподіяну Покупцеві внаслідок неналежного використання придбаних ним Товарів.<br></br>
                9.3. У випадках, не передбачених цим Договором, Сторони несуть відповідальність, встановлену чинним законодавством України.<br></br>
                9.4. Продавець розглядає претензії Покупців протягом 30 (тридцять) робочих днів з моменту отримання таких претензій.<br></br>
                9.5. Покупець несе відповідальність за правильність внесених даних до форми Замовлення.
            </span>
            <h5 className={styles.headerText}>10. ПОРЯДОК ВИРІШЕННЯ СПОРІВ</h5>
            <span className={styles.textDescribe}>
                10.1 Всі спірні питання, які можуть виникнути щодо цього Договору або у зв’язку з його виконанням Покупець та Продавець вирішують шляхом проведення переговорів. Досудовий порядок врегулювання спору є обов’язковим.<br></br>
                10.2. Всі спірні питання розглядаються за наявності письмової претензії, що направлена рекомендованим листом засобами поштового зв’язку.<br></br>
                10.3. У випадку, якщо Покупець та Продавець не зможуть досягти згоди по спірним питанням шляхом переговорів, ці питання підлягають вирішенню згідно з діючим законодавством України.<br></br>
            </span>
            <h5 className={styles.headerText}>11. КОНФІДЕНЦІЙНІСТЬ І ЗАХИСТ ІНФОРМАЦІЇ </h5>
            <span className={styles.textDescribe}>
                11.1. Покупець дає свою згоду Продавцю на збір, обробку, накопичення, зберігання та використання своїх персональних даних (ім’я, номер мобільного телефону та інші персональні дані), а також передання їх третім особам виключно з ціллю та в межах забезпечення Продавцем виконання обов’язків покладених на нього відповідно до умов даної оферти. Персональні дані Покупця обробляються відповідно до Закону України від 01 червня 2010 № 2297-VI «Про захист персональних даних». Персональні дані Покупців зберігаються в базі даних Продавця. Персональні дані Покупців збираються виключно з метою виконання умов даної оферти, дотримання норм у сфері регулювання податкових відносин, відносин у сфері бухгалтерського обліку та відносин у сфері реклами.<br></br>
                11.2. Продавець має право відправляти інформаційні, в тому числі рекламні повідомлення, на мобільний телефон Покупця з його згоди. Покупець має право відмовитися від отримання рекламної та іншої інформації без пояснення причин відмови, направивши письмову заяву про відмову від отримання рекламної та іншої інформації Продавцю за адресою, вказаною на Сайті. Сервісні повідомлення, що інформують Покупця про замовлення і етапи його обробки, відправляються автоматично і не можуть бути відхилені Покупцем.<br></br>
                11.3. Продавець не несе відповідальності за відомості, надані Покупцем на Сайті в загальнодоступній формі.<br></br>
                11.4. Продавець вправі здійснювати записи телефонних розмов з Покупцем, попередньо повідомивши Покупця про такий запис. При цьому Продавець зобов’язується: запобігати спробам несанкціонованого доступу до інформації, отриманої в ході телефонних переговорів, та/або передачу її третім особам, які не мають безпосереднього відношення до виконання Замовлень, відповідно до Закону України від 02.10.1992 року № 2657-XII «Про інформацію».</span>
        </div>
    )
}
